In [1]:
import numpy as np
np.__version__

'1.20.3'

In [2]:
import pandas as pd

In [5]:
#using lists
l=[1,2,3,4]
df=pd.DataFrame(l)
m=[['abc',30],['xyz',90],['pqs',93]]
p=[['ss',90],['bi',78],[98,'jo']]
df=pd.DataFrame(p,columns=['name','marks'])
#df=pd.DataFrame(m,columns=['name','marks'])
df=pd.DataFrame(p)
print(df)

  name marks
0   ss    90
1   bi    78
2   98    jo

In [16]:
#using dictionaries
d={'name':['sravani','akhila','nlkhjl'],'marks':[23,56,78]}
d=pd.DataFrame(d)
print(pd.DataFrame(d))

      name  marks
0  sravani     23
1   akhila     56
2   nlkhjl     78

In [ ]:
#using list of dictionaries

In [18]:
a=[{'a':[1,2,3,4],'b':[7,8,9,1],'c':[2,3,4,5]},{'f':[6,7,8,9],'k':[2,3,4,6],'m':[4,5,6,7]}]
print(pd.DataFrame(a))

              a             b             c             f             k  \
0  [1, 2, 3, 4]  [7, 8, 9, 1]  [2, 3, 4, 5]           NaN           NaN
1           NaN           NaN           NaN  [6, 7, 8, 9]  [2, 3, 4, 6]

              m
0           NaN
1  [4, 5, 6, 7]

In [19]:
#deleting a column
d.pop('name')

0    sravani
1     akhila
2     nlkhjl
Name: name, dtype: object

In [20]:
print(d)

   marks
0     23
1     56
2     78

In [29]:
# loc and iloc
df.loc[[0,1]]

  name marks
0   ss    90
1   bi    78

In [24]:
df

  name marks
0   ss    90
1   bi    78
2   98    jo

In [27]:
df[0:9]

  name marks
0   ss    90
1   bi    78
2   98    jo

In [28]:
#drop rows
df.drop(1)

  name marks
0   ss    90
2   98    jo

In [30]:
d['marks'].mean()

52.333333333333336

In [33]:
d['marks'].mode()[0]

23

In [40]:
a=pd.Series([2,4,6,8,10])
b=pd.Series([1,3,5,7,10])
print(a==b)
print(a.compare(b))

0    False
1    False
2    False
3    False
4     True
dtype: bool
   self  other
0   2.0    1.0
1   4.0    3.0
2   6.0    5.0
3   8.0    7.0

In [39]:
a=pd.Series([5,6,7,8,9,3])
a=list(a)
print(a)
print(type(a))

[5, 6, 7, 8, 9, 3]
<class 'list'>

In [64]:
a=pd.Series([100,200,'python',300.12,400])
print(type(a))
b=np.asarray(a)
print(type(b))
print(b)
print(type(b[0]))

<class 'pandas.core.series.Series'>
<class 'numpy.ndarray'>
[100 200 'python' 300.12 400]
<class 'int'>

In [69]:
b=np.array(pd.Series([100,200,'python',300.12,400]))
print(type(b))
print(b)

<class 'numpy.ndarray'>
[100 200 'python' 300.12 400]

In [74]:
#list
k=pd.Series([[1,2,4,5],[4,5,6,7]])
print(k)
print(type(k))
#numpy
f=pd.Series(np.array([1,2,3,5]))
print(f,type(f))
#dict
d={'a':[1,2,3,4],'v':[1,2,5,7]}
b=pd.Series(d)
print(b)

0    [1, 2, 4, 5]
1    [4, 5, 6, 7]
dtype: object
<class 'pandas.core.series.Series'>
0    1
1    2
2    3
3    5
dtype: int32 <class 'pandas.core.series.Series'>
a    [1, 2, 3, 4]
v    [1, 2, 5, 7]
dtype: object

In [78]:
c1=pd.Series([1,2,3,4])
c2=pd.Series([6,7,8,9])
c3=pd.Series([3,5,6,7])
df=pd.DataFrame({'a':c1,'b':c2,'c':c3})
print(df)

   a  b  c
0  1  6  3
1  2  7  5
2  3  8  6
3  4  9  7

In [88]:
#frequency_counts
g=pd.Series([1,1,2,7,3,3,3,3,4])
c=0
print(g.value_counts())

3    4
1    2
2    1
7    1
4    1
dtype: int64

In [90]:
a=np.array([1,3,4,6,7,8])
a.resize(2,2)
a=pd.DataFrame(a)
print(a)

   0  1
0  1  3
1  4  6

In [95]:
df=pd.read_csv("C:/Users/exam2/Documents/Book1.csv",usecols=['b','c'])
print(df)

   b   c
0  5  56
1  6   5
2  6   4
3  7   4
4  7   4

In [107]:
df=df.reindex(columns=['c','b'])
print(df)

    c  b
0  56  5
1   5  6
2   4  6
3   4  7
4   4  7

In [108]:
print(df.loc[::-1])

    c  b
4   4  7
3   4  7
2   4  6
1   5  6
0  56  5